<template>
  <div id="app">
    <ReviewsSlider :reviews="reviews" />
  </div>
</template>

<script>
import ReviewsSlider from './ReviewsSlider.vue';

export default {
  name: 'App',
  components: {
    ReviewsSlider,
  },
  data() {
    return {
      reviews: [
        { id: 1, name: 'Максим', text: 'Недавно я установил сплит-систему в своём офисе и остался очень доволен результатом. Мастера приехали вовремя, были вежливы и профессиональны. Они внимательно выслушали мои пожелания и предложили оптимальное решение. Установка прошла быстро и без проблем. Теперь в моём офисе всегда комфортная температура, а сотрудники довольны условиями работы. Рекомендую эту компанию всем, кто ищет надёжных специалистов по установке сплит-систем!' },
        { id: 2, name: 'Тимур', text: 'Сегодня хочу поделиться своим положительным опытом установки сплит-системы. Бригада монтажников приехала вовремя, аккуратно и быстро выполнила свою работу. Результат превзошёл все ожидания: кондиционер установлен качественно, без пыли и мусора. После завершения работы они проверили систему и проконсультировали меня по вопросам обслуживания. Я очень доволен работой этой бригады и рекомендую их услуги всем, кто ищет качественный монтаж сплит-системы.' },
        { id: 3, name: 'Евгений', text: 'Недавно мы решили установить сплит-систему в нашем доме, и это было одно из лучших решений, которые мы приняли в этом году. Процесс установки прошел гладко и без лишних хлопот, благодаря профессионализму специалистов. Шум от работы системы практически не слышен, что также является огромным плюсом. В целом, мы остались чрезвычайно довольны и рекомендуем всем, кто думает об установке кондиционера, выбрать именно сплит-систему!' },
        { id: 4, name: 'Дмитрий', text: 'Установка сплит-системы в нашем доме стала настоящим спасением в летнюю жару. Работы по установке прошли быстро и профессионально, что значительно сэкономило наше время. Мы были приятно удивлены, насколько тихо работает система — почти не слышно шума. Освежающий прохладный воздух распределяется равномерно по всему дому, что делает пребывание в нем особенно приятным. Мы невероятно довольны этой покупкой и рекомендуем всем, кто еще сомневается, обязательно установить сплит-систему!' },
      ],
    };
  },
};
</script>

<style>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  margin-top: 60px;
}
</style>